server/tests/load/stress-test.yml
# server/tests/load/stress-test.yml
# 스트레스 테스트 - 시스템 한계 확인용

config:
  target: 'http://localhost:3000'
  phases:
    # 1단계: 초당 5명
    - duration: 30
      arrivalRate: 5
      name: 'Low load'
    # 2단계: 초당 20명
    - duration: 30
      arrivalRate: 20
      name: 'Medium load'
    # 3단계: 초당 50명 (스트레스)
    - duration: 30
      arrivalRate: 50
      name: 'High load'
    # 4단계: 초당 100명 (극한)
    - duration: 30
      arrivalRate: 100
      name: 'Stress load'
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: 'API Stress'
    flow:
      - get:
          url: '/api/v1/units?page=1&limit=20'
      - think: 1
      - get:
          url: '/api/v1/metadata/teams'